HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
class_inhert(PikaStdLib_SysObj, TinyObj);

PikaObj *New_PikaStdLib_SysObj(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_SysObj);
    return self;
}

Arg *PikaStdLib_SysObj(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdLib_SysObj);
}
#endif

#ifndef PIKA_MODULE_PIKASTDTASK_DISABLE
void PikaStdTask_TaskMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdTask_Task(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdTask_Task,
    "Task", ""
);

class_def(PikaStdTask){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaStdTask_Task, 2089601848),
};
class_inhert(PikaStdTask, TinyObj);

PikaObj *New_PikaStdTask(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdTask);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDTASK_DISABLE
void PikaStdTask_Task___init__Method(PikaObj *self, Args *args){
    PikaStdTask_Task___init__(self);
}
method_typedef(
    PikaStdTask_Task___init__,
    "__init__", ""
);

void PikaStdTask_Task_call_alwaysMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    PikaStdTask_Task_call_always(self, fun_todo);
}
method_typedef(
    PikaStdTask_Task_call_always,
    "call_always", "fun_todo"
);

void PikaStdTask_Task_call_period_msMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    int period_ms = args_getInt(args, "period_ms");
    PikaStdTask_Task_call_period_ms(self, fun_todo, period_ms);
}
method_typedef(
    PikaStdTask_Task_call_period_ms,
    "call_period_ms", "fun_todo,period_ms"
);

void PikaStdTask_Task_call_whenMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    Arg* fun_when = args_getArg(args, "fun_when");
    PikaStdTask_Task_call_when(self, fun_todo, fun_when);
}
method_typedef(
    PikaStdTask_Task_call_when,
    "call_when", "fun_todo,fun_when"
);

void PikaStdTask_Task_platformGetTickMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_platformGetTick(self);
}
method_typedef(
    PikaStdTask_Task_platformGetTick,
    "platformGetTick", ""
);

void PikaStdTask_Task_run_foreverMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_run_forever(self);
}
method_typedef(
    PikaStdTask_Task_run_forever,
    "run_forever", ""
);

void PikaStdTask_Task_run_onceMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_run_once(self);
}
method_typedef(
    PikaStdTask_Task_run_once,
    "run_once", ""
);

void PikaStdTask_Task_run_until_msMethod(PikaObj *self, Args *args){
    int until_ms = args_getInt(args, "until_ms");
    PikaStdTask_Task_run_until_ms(self, until_ms);
}
method_typedef(
    PikaStdTask_Task_run_until_ms,
    "run_until_ms", "until_ms"
);

class_def(PikaStdTask_Task){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdTask_Task_run_forever, 408322738),
    method_def(PikaStdTask_Task_run_until_ms, 854930212),
    method_def(PikaStdTask_Task___init__, 904762485),
    method_def(PikaStdTask_Task_call_always, 1368427953),
    method_def(PikaStdTask_Task_call_period_ms, 1674236450),
    method_def(PikaStdTask_Task_run_once, 1726949022),
    method_def(PikaStdTask_Task_platformGetTick, 1897947957),
    method_def(PikaStdTask_Task_call_when, 2141638002),
};
class_inhert(PikaStdTask_Task, PikaStdLib_SysObj);

PikaObj *New_PikaStdTask_Task(Args *args){
    PikaObj *self = New_PikaStdLib_SysObj(args);
    obj_newObj(self, "calls", "PikaStdData_List", New_PikaStdData_List);
    obj_setClass(self, PikaStdTask_Task);
    return self;
}

Arg *PikaStdTask_Task(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdTask_Task);
}
#endif

#ifndef PIKA_MODULE__BLUETOOTH_DISABLE
void _bluetooth_BLEMethod(PikaObj *self, Args *args){
    Arg* res = _bluetooth_BLE(self);
    method_returnArg(args, res);
}
method_typedef(
    _bluetooth_BLE,
    "BLE", ""
);

class_def(_bluetooth){
    __BEFORE_MOETHOD_DEF
    constructor_def(_bluetooth_BLE, 193451448),
};
class_inhert(_bluetooth, TinyObj);

PikaObj *New__bluetooth(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, _bluetooth);
    return self;
}
#endif

#ifndef PIKA_MODULE__BLUETOOTH_DISABLE
void _bluetooth_BLE___init__Method(PikaObj *self, Args *args){
    PikaObj* res = _bluetooth_BLE___init__(self);
    method_returnObj(args, res);
}
method_typedef(
    _bluetooth_BLE___init__,
    "__init__", ""
);

void _bluetooth_BLE_activeMethod(PikaObj *self, Args *args){
    _bluetooth_BLE_active(self);
}
method_typedef(
    _bluetooth_BLE_active,
    "active", ""
);

void _bluetooth_BLE_gap_advertiseMethod(PikaObj *self, Args *args){
    _bluetooth_BLE_gap_advertise(self);
}
method_typedef(
    _bluetooth_BLE_gap_advertise,
    "gap_advertise", ""
);

void _bluetooth_BLE_gap_connectMethod(PikaObj *self, Args *args){
    int addr_type = args_getInt(args, "addr_type");
    char* addr = args_getStr(args, "addr");
    int64_t scan_duration_ms = args_getInt(args, "scan_duration_ms");
    int res = _bluetooth_BLE_gap_connect(self, addr_type, addr, scan_duration_ms);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gap_connect,
    "gap_connect", "addr_type,addr,scan_duration_ms"
);

void _bluetooth_BLE_gap_disconnectMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_gap_disconnect(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gap_disconnect,
    "gap_disconnect", ""
);

void _bluetooth_BLE_gap_scanMethod(PikaObj *self, Args *args){
    int duration_ms = args_getInt(args, "duration_ms");
    int interval_us = args_getInt(args, "interval_us");
    int window_us = args_getInt(args, "window_us");
    PIKA_BOOL active = args_getBool(args, "active");
    int res = _bluetooth_BLE_gap_scan(self, duration_ms, interval_us, window_us, active);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gap_scan,
    "gap_scan", "duration_ms,interval_us,window_us,active"
);

void _bluetooth_BLE_gap_stop_scanMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_gap_stop_scan(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gap_stop_scan,
    "gap_stop_scan", ""
);

void _bluetooth_BLE_initMethod(PikaObj *self, Args *args){
    _bluetooth_BLE_init(self);
}
method_typedef(
    _bluetooth_BLE_init,
    "init", ""
);

void _bluetooth_BLE_register_a_serviceMethod(PikaObj *self, Args *args){
    PikaObj* service_info = args_getPtr(args, "service_info");
    int res = _bluetooth_BLE_register_a_service(self, service_info);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_register_a_service,
    "register_a_service", "service_info"
);

void _bluetooth_BLE_set_adv_dataMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    int data_len = args_getInt(args, "data_len");
    int res = _bluetooth_BLE_set_adv_data(self, data, data_len);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_set_adv_data,
    "set_adv_data", "data,data_len"
);

