HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void _bluetooth_BLE_set_rsp_dataMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    int data_len = args_getInt(args, "data_len");
    int res = _bluetooth_BLE_set_rsp_data(self, data, data_len);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_set_rsp_data,
    "set_rsp_data", "data,data_len"
);

void _bluetooth_BLE_stop_advertiseMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_stop_advertise(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_stop_advertise,
    "stop_advertise", ""
);

void _bluetooth_BLE_testMethod(PikaObj *self, Args *args){
    _bluetooth_BLE_test(self);
}
method_typedef(
    _bluetooth_BLE_test,
    "test", ""
);

class_def(_bluetooth_BLE){
    __BEFORE_MOETHOD_DEF
    method_def(_bluetooth_BLE_gap_connect, 239981286),
    method_def(_bluetooth_BLE_gap_stop_scan, 257876614),
    method_def(_bluetooth_BLE_stop_advertise, 259007825),
    method_def(_bluetooth_BLE_gap_advertise, 487130755),
    method_def(_bluetooth_BLE_gap_disconnect, 714357958),
    method_def(_bluetooth_BLE_set_adv_data, 862102692),
    method_def(_bluetooth_BLE___init__, 904762485),
    method_def(_bluetooth_BLE_gap_scan, 1094358433),
    method_def(_bluetooth_BLE_register_a_service, 1446124378),
    method_def(_bluetooth_BLE_set_rsp_data, 1483498270),
    method_def(_bluetooth_BLE_active, 1902398945),
    method_def(_bluetooth_BLE_init, 2090370361),
    method_def(_bluetooth_BLE_test, 2090756197),
};
class_inhert(_bluetooth_BLE, TinyObj);

PikaObj *New__bluetooth_BLE(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, _bluetooth_BLE);
    return self;
}

Arg *_bluetooth_BLE(PikaObj *self){
    return obj_newObjInPackage(New__bluetooth_BLE);
}
#endif

#ifndef PIKA_MODULE__TIME_DISABLE
void _time___init__Method(PikaObj *self, Args *args){
    _time___init__(self);
}
method_typedef(
    _time___init__,
    "__init__", ""
);

void _time_asctimeMethod(PikaObj *self, Args *args){
    _time_asctime(self);
}
method_typedef(
    _time_asctime,
    "asctime", ""
);

void _time_ctimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    _time_ctime(self, unix_time);
}
method_typedef(
    _time_ctime,
    "ctime", "unix_time"
);

void _time_gmtimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    _time_gmtime(self, unix_time);
}
method_typedef(
    _time_gmtime,
    "gmtime", "unix_time"
);

void _time_localtimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    _time_localtime(self, unix_time);
}
method_typedef(
    _time_localtime,
    "localtime", "unix_time"
);

void _time_mktimeMethod(PikaObj *self, Args *args){
    int res = _time_mktime(self);
    method_returnInt(args, res);
}
method_typedef(
    _time_mktime,
    "mktime", ""
);

void _time_platformGetTickMethod(PikaObj *self, Args *args){
    _time_platformGetTick(self);
}
method_typedef(
    _time_platformGetTick,
    "platformGetTick", ""
);

void _time_sleep_msMethod(PikaObj *self, Args *args){
    int ms = args_getInt(args, "ms");
    _time_sleep_ms(self, ms);
}
method_typedef(
    _time_sleep_ms,
    "sleep_ms", "ms"
);

void _time_sleep_sMethod(PikaObj *self, Args *args){
    int s = args_getInt(args, "s");
    _time_sleep_s(self, s);
}
method_typedef(
    _time_sleep_s,
    "sleep_s", "s"
);

void _time_timeMethod(PikaObj *self, Args *args){
    pika_float res = _time_time(self);
    method_returnFloat(args, res);
}
method_typedef(
    _time_time,
    "time", ""
);

void _time_time_nsMethod(PikaObj *self, Args *args){
    int res = _time_time_ns(self);
    method_returnInt(args, res);
}
method_typedef(
    _time_time_ns,
    "time_ns", ""
);

class_def(_time){
    __BEFORE_MOETHOD_DEF
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_gmtime, 1586568),
#endif
    method_def(_time_sleep_ms, 164842493),
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_mktime, 234027084),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_ctime, 255845143),
#endif
    method_def(_time_sleep_s, 460522064),
    method_def(_time___init__, 904762485),
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_localtime, 907356095),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_asctime, 1108526539),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_time_ns, 1644053204),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_platformGetTick, 1897947957),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_time, 2090760340),
#endif
};
class_inhert(_time, TinyObj);

PikaObj *New__time(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, _time);
    return self;
}
#endif

#ifndef PIKA_MODULE_MYTEST_DISABLE
void mytest_MYTESTMethod(PikaObj *self, Args *args){
    Arg* res = mytest_MYTEST(self);
    method_returnArg(args, res);
}
method_typedef(
    mytest_MYTEST,
    "MYTEST", ""
);

class_def(mytest){
    __BEFORE_MOETHOD_DEF
    constructor_def(mytest_MYTEST, 1106641515),
};
class_inhert(mytest, TinyObj);

PikaObj *New_mytest(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, mytest);
    return self;
}
#endif

#ifndef PIKA_MODULE_MYTEST_DISABLE
void mytest_MYTEST_testMethod(PikaObj *self, Args *args){
    mytest_MYTEST_test(self);
}
method_typedef(
    mytest_MYTEST_test,
    "test", ""
);

class_def(mytest_MYTEST){
    __BEFORE_MOETHOD_DEF
    method_def(mytest_MYTEST_test, 2090756197),
};
class_inhert(mytest_MYTEST, TinyObj);

PikaObj *New_mytest_MYTEST(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, mytest_MYTEST);
    return self;
}

Arg *mytest_MYTEST(PikaObj *self){
    return obj_newObjInPackage(New_mytest_MYTEST);
}
#endif

#ifndef PIKA_MODULE_PIKA_LIBC_DISABLE
class_def(pika_libc){
    __BEFORE_MOETHOD_DEF
};
class_inhert(pika_libc, TinyObj);

PikaObj *New_pika_libc(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, pika_libc);
    return self;
}
#endif

